STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233axx_cm33.h
typedef struct
{                                  /*!< ************** Register description **************                            Address offset */
  __IO uint32_t SECCFGR[4];          /*!< RCC Secure Configuration Register x (x=0 to 3)                                Address offset: 0x000-0x00c */
  __IO uint32_t PRIVCFGR[4];       /*!< RCC Privileged Configuration Register x (x=0 to 3)                            Address offset: 0x010-0x01c */
  __IO uint32_t RCFGLOCKR[4];      /*!< RCC Resource Configuration Lock Register x (x=0 to 3)                         Address offset: 0x020-0x02c */
       RCC_Comp_TypeDef R[114];    /*!< RCC Resource x Compartment Configuration (x=0 to 113)                         Address offset: 0x030-0x3bc */
       uint32_t RESERVED0[16];     /*!< Reserved                                                                      Address offset: 0x3c0-0x3fc */
  __IO uint32_t GRSTCSETR;         /*!< RCC Global Reset Control Set Register                                         Address offset: 0x400 */
  __IO uint32_t C1RSTCSETR;        /*!< RCC CPU1 Reset Control Set Register                                           Address offset: 0x404 */
  __IO uint32_t C1P1RSTCSETR;      /*!< RCC CPU1 Processor 1 Reset Control Set Register                               Address offset: 0x408 */
  __IO uint32_t C2RSTCSETR;        /*!< RCC CPU2 Reset Control Set Register                                           Address offset: 0x40c */
  __IO uint32_t HWRSTSCLRR;        /*!< RCC Hardware Reset Status Clear Register                                      Address offset: 0x410 */
  __IO uint32_t C1HWRSTSCLRR;      /*!< RCC CPU1 Hardware Reset Status Clear Register                                 Address offset: 0x414 */
  __IO uint32_t C2HWRSTSCLRR;      /*!< RCC CPU2 Hardware Reset Status Clear Register                                 Address offset: 0x418 */
  __IO uint32_t C1BOOTRSTSSETR;    /*!< RCC CPU1 BOOT Reset Status Set Register                                       Address offset: 0x41c */
  __IO uint32_t C1BOOTRSTSCLRR;    /*!< RCC CPU1 BOOT Reset Status Clear Register                                     Address offset: 0x420 */
  __IO uint32_t C2BOOTRSTSSETR;    /*!< RCC CPU2 BOOT Reset Status Set Register                                       Address offset: 0x424 */
  __IO uint32_t C2BOOTRSTSCLRR;    /*!< RCC CPU2 BOOT Reset Status Clear Register                                     Address offset: 0x428 */
  __IO uint32_t C1SREQSETR;        /*!< RCC CPU1 Stop Request Set Register                                            Address offset: 0x42c */
  __IO uint32_t C1SREQCLRR;        /*!< RCC CPU1 Stop Request Clear Register                                          Address offset: 0x430 */
  __IO uint32_t CPUBOOTCR;         /*!< RCC CPU Boot Control Register                                                 Address offset: 0x434 */
  __IO uint32_t STBYBOOTCR;        /*!< RCC Standby Boot Control Register                                             Address offset: 0x438 */
  __IO uint32_t LEGBOOTCR;         /*!< RCC Legacy Boot Control Register                                              Address offset: 0x43c */
  __IO uint32_t BDCR;              /*!< RCC Backup Domain Control Register                                            Address offset: 0x440 */
  __IO uint32_t D3DCR;             /*!< RCC SmartRun Domain Control Register                                          Address offset: 0x444 */
  __IO uint32_t D3DSR;             /*!< RCC SmartRun Domain Status Register                                           Address offset: 0x448 */
  __IO uint32_t RDCR;              /*!< RCC Reset Duration Control Register                                           Address offset: 0x44c */
  __IO uint32_t C1MSRDCR;          /*!< RCC C1MS Reset Delay Control Register                                         Address offset: 0x450 */
  __IO uint32_t PWRLPDLYCR;        /*!< RCC PWR_LP Delay Control Register                                             Address offset: 0x454 */
  __IO uint32_t C1CIESETR;         /*!< RCC CPU1 Clock Source Interrupt Enable Set Register                           Address offset: 0x458 */
  __IO uint32_t C1CIFCLRR;         /*!< RCC CPU1 Clock Source Interrupt Flag Clear Register                           Address offset: 0x45c */
  __IO uint32_t C2CIESETR;         /*!< RCC CPU2 Clock Source Interrupt Enable Set Register                           Address offset: 0x460 */
  __IO uint32_t C2CIFCLRR;         /*!< RCC CPU2 Clock Source Interrupt Flag Clear Register                           Address offset: 0x464 */
  __IO uint32_t IWDGC1FZSETR;      /*!< RCC IWDG CPU1 Clock Freeze Set Register                                       Address offset: 0x468 */
  __IO uint32_t IWDGC1FZCLRR;      /*!< RCC IWDG CPU1 Clock Freeze Clear Register                                     Address offset: 0x46c */
  __IO uint32_t IWDGC1CFGSETR;     /*!< RCC IWDG CPU1 Configuration Set Register                                      Address offset: 0x470 */
  __IO uint32_t IWDGC1CFGCLRR;     /*!< RCC IWDG CPU1 Configuration Clear Register                                    Address offset: 0x474 */
  __IO uint32_t IWDGC2FZSETR;      /*!< RCC IWDG CPU2 Clock Freeze Set Register                                       Address offset: 0x478 */
  __IO uint32_t IWDGC2FZCLRR;      /*!< RCC IWDG CPU2 Clock Freeze Clear Register                                     Address offset: 0x47c */
  __IO uint32_t IWDGC2CFGSETR;     /*!< RCC IWDG CPU2 Configuration Set Register                                      Address offset: 0x480 */
  __IO uint32_t IWDGC2CFGCLRR;     /*!< RCC IWDG CPU2 Configuration Clear Register                                    Address offset: 0x484 */
  __IO uint32_t IWDGC3CFGSETR;     /*!< RCC IWDG CPU3 Configuration Set Register                                      Address offset: 0x488 */
  __IO uint32_t IWDGC3CFGCLRR;     /*!< RCC IWDG CPU3 Configuration Clear Register                                    Address offset: 0x48c */
  __IO uint32_t C3CFGR;            /*!< RCC CPU3 Configuration Register                                               Address offset: 0x490 */
  __IO uint32_t MCO1CFGR;          /*!< RCC MCO1 Configuration Register                                               Address offset: 0x494 */
  __IO uint32_t MCO2CFGR;          /*!< RCC MCO2 Configuration Register                                               Address offset: 0x498 */
  __IO uint32_t OCENSETR;          /*!< RCC Oscillator Clock Enable Set Register                                      Address offset: 0x49c */
  __IO uint32_t OCENCLRR;          /*!< RCC Oscillator Clock Enable Clear Register                                    Address offset: 0x4a0 */
  __IO uint32_t OCRDYR;            /*!< RCC Oscillator Clock Ready Register                                           Address offset: 0x4a4 */
  __IO uint32_t HSICFGR;           /*!< RCC HSI Configuration Register                                                Address offset: 0x4a8 */
  __IO uint32_t MSICFGR;           /*!< RCC MSI Configuration Register                                                Address offset: 0x4ac */
  __IO uint32_t RTCDIVR;           /*!< RCC RTC Clock Divider Register                                                Address offset: 0x4b0 */
  __IO uint32_t APB1DIVR;          /*!< RCC APB1 Clock Divider Register                                               Address offset: 0x4b4 */
  __IO uint32_t APB2DIVR;          /*!< RCC APB2 Clock Divider Register                                               Address offset: 0x4b8 */
  __IO uint32_t APB3DIVR;          /*!< RCC APB3 Clock Divider Register                                               Address offset: 0x4bc */
  __IO uint32_t APB4DIVR;          /*!< RCC APB4 Clock Divider Register                                               Address offset: 0x4c0 */
  __IO uint32_t APBDBGDIVR;        /*!< RCC APBDBG Clock Divider Register                                             Address offset: 0x4c4 */
  __IO uint32_t TIMG1PRER;         /*!< RCC TIM Group 1 Prescaler Register                                            Address offset: 0x4c8 */
  __IO uint32_t TIMG2PRER;         /*!< RCC TIM Group 2 Prescaler Register                                            Address offset: 0x4cc */
  __IO uint32_t LSMCUDIVR;         /*!< RCC LSMCU Clock Divider Register                                              Address offset: 0x4d0 */
  __IO uint32_t DDRCPCFGR;         /*!< RCC DDRC AXI Ports Configuration Register                                     Address offset: 0x4d4 */
  __IO uint32_t DDRCAPBCFGR;       /*!< RCC DDRC APB Configuration Register                                           Address offset: 0x4d8 */
  __IO uint32_t DDRPHYCAPBCFGR;    /*!< RCC DDRPHYC APB Configuration Register                                        Address offset: 0x4dc */
  __IO uint32_t DDRPHYCCFGR;       /*!< RCC DDRPHYC Configuration Register                                            Address offset: 0x4e0 */
  __IO uint32_t DDRCFGR;           /*!< RCC DDR Configuration Register                                                Address offset: 0x4e4 */
  __IO uint32_t DDRITFCFGR;        /*!< RCC DDR Interface Configuration Register                                      Address offset: 0x4e8 */
       uint32_t RESERVED1;         /*!< Reserved                                                                      Address offset: 0x4ec */
  __IO uint32_t SYSRAMCFGR;        /*!< RCC SYSRAM Configuration Register                                             Address offset: 0x4f0 */
  __IO uint32_t VDERAMCFGR;        /*!< RCC VDERAM Configuration Register                                             Address offset: 0x4f4 */
  __IO uint32_t SRAM1CFGR;         /*!< RCC SRAM1 Configuration Register                                              Address offset: 0x4f8 */
  __IO uint32_t SRAM2CFGR;         /*!< RCC SRAM2 Configuration Register                                              Address offset: 0x4fc */
  __IO uint32_t RETRAMCFGR;        /*!< RCC RETRAM Configuration Register                                             Address offset: 0x500 */
  __IO uint32_t BKPSRAMCFGR;       /*!< RCC BKPSRAM Configuration Register                                            Address offset: 0x504 */
  __IO uint32_t LPSRAM1CFGR;       /*!< RCC LPSRAM1 Configuration Register                                            Address offset: 0x508 */
  __IO uint32_t LPSRAM2CFGR;       /*!< RCC LPSRAM2 Configuration Register                                            Address offset: 0x50c */
  __IO uint32_t LPSRAM3CFGR;       /*!< RCC LPSRAM3 Configuration Register                                            Address offset: 0x510 */
  __IO uint32_t OSPI1CFGR;         /*!< RCC OSPI1 Configuration Register                                              Address offset: 0x514 */
  __IO uint32_t OSPI2CFGR;         /*!< RCC OSPI2 Configuration Register                                              Address offset: 0x518 */
  __IO uint32_t FMCCFGR;           /*!< RCC FMC Configuration Register                                                Address offset: 0x51c */
  __IO uint32_t DBGCFGR;           /*!< RCC Debug Configuration Register                                              Address offset: 0x520 */
  __IO uint32_t STMCFGR;           /*!< RCC STM Configuration Register                                                Address offset: 0x524 */
  __IO uint32_t ETRCFGR;           /*!< RCC ETR Configuration Register                                                Address offset: 0x528 */
  __IO uint32_t GPIOACFGR;         /*!< RCC GPIOA Configuration Register                                              Address offset: 0x52c */
  __IO uint32_t GPIOBCFGR;         /*!< RCC GPIOB Configuration Register                                              Address offset: 0x530 */
  __IO uint32_t GPIOCCFGR;         /*!< RCC GPIOC Configuration Register                                              Address offset: 0x534 */
  __IO uint32_t GPIODCFGR;         /*!< RCC GPIOD Configuration Register                                              Address offset: 0x538 */
  __IO uint32_t GPIOECFGR;         /*!< RCC GPIOE Configuration Register                                              Address offset: 0x53c */
  __IO uint32_t GPIOFCFGR;         /*!< RCC GPIOF Configuration Register                                              Address offset: 0x540 */
  __IO uint32_t GPIOGCFGR;         /*!< RCC GPIOG Configuration Register                                              Address offset: 0x544 */
  __IO uint32_t GPIOHCFGR;         /*!< RCC GPIOH Configuration Register                                              Address offset: 0x548 */
  __IO uint32_t GPIOICFGR;         /*!< RCC GPIOI Configuration Register                                              Address offset: 0x54c */
  __IO uint32_t GPIOJCFGR;         /*!< RCC GPIOJ Configuration Register                                              Address offset: 0x550 */
  __IO uint32_t GPIOKCFGR;         /*!< RCC GPIOK Configuration Register                                              Address offset: 0x554 */
  __IO uint32_t GPIOZCFGR;         /*!< RCC GPIOZ Configuration Register                                              Address offset: 0x558 */
  __IO uint32_t HPDMA1CFGR;        /*!< RCC HPDMA1 Configuration Register                                             Address offset: 0x55c */
  __IO uint32_t HPDMA2CFGR;        /*!< RCC HPDMA2 Configuration Register                                             Address offset: 0x560 */
  __IO uint32_t HPDMA3CFGR;        /*!< RCC HPDMA3 Configuration Register                                             Address offset: 0x564 */
  __IO uint32_t LPDMACFGR;         /*!< RCC LPDMA Configuration Register                                              Address offset: 0x568 */
  __IO uint32_t HSEMCFGR;          /*!< RCC HSEM Configuration Register                                               Address offset: 0x56c */
  __IO uint32_t IPCC1CFGR;         /*!< RCC IPCC1 Configuration Register                                              Address offset: 0x570 */
  __IO uint32_t IPCC2CFGR;         /*!< RCC IPCC2 Configuration Register                                              Address offset: 0x574 */
  __IO uint32_t RTCCFGR;           /*!< RCC RTC Configuration Register                                                Address offset: 0x578 */
       uint32_t RESERVED2;         /*!< Reserved                                                                      Address offset: 0x57c */
  __IO uint32_t SYSCPU1CFGR;       /*!< RCC SYSCPU1 Configuration Register                                            Address offset: 0x580 */
  __IO uint32_t BSECCFGR;          /*!< RCC BSEC Configuration Register                                               Address offset: 0x584 */
       uint32_t RESERVED3[2];      /*!< Reserved                                                                      Address offset: 0x0588-0x058C */
  __IO uint32_t PLL2CFGR1;         /*!< RCC PLL{x} Configuration Register 1                                           Address offset: 0x590 */
  __IO uint32_t PLL2CFGR2;         /*!< RCC PLL{x} Configuration Register 2                                           Address offset: 0x594 */
  __IO uint32_t PLL2CFGR3;         /*!< RCC PLL{x} Configuration Register 3                                           Address offset: 0x598 */
  __IO uint32_t PLL2CFGR4;         /*!< RCC PLL{x} Configuration Register 4                                           Address offset: 0x59c */
  __IO uint32_t PLL2CFGR5;         /*!< RCC PLL{x} Configuration Register 5                                           Address offset: 0x5a0 */
       uint32_t RESERVED4;         /*!< Reserved                                                                      Address offset: 0x5a4 */
  __IO uint32_t PLL2CFGR6;         /*!< RCC PLL{x} Configuration Register 6                                           Address offset: 0x5a8 */
  __IO uint32_t PLL2CFGR7;         /*!< RCC PLL{x} Configuration Register 7                                           Address offset: 0x5ac */
       uint32_t RESERVED5[2];      /*!< Reserved                                                                      Address offset: 0x5b0-0x5b4 */
  __IO uint32_t PLL3CFGR1;         /*!< RCC PLL{x} Configuration Register 1                                           Address offset: 0x5b8 */
  __IO uint32_t PLL3CFGR2;         /*!< RCC PLL{x} Configuration Register 2                                           Address offset: 0x5bc */
  __IO uint32_t PLL3CFGR3;         /*!< RCC PLL{x} Configuration Register 3                                           Address offset: 0x5c0 */
  __IO uint32_t PLL3CFGR4;         /*!< RCC PLL{x} Configuration Register 4                                           Address offset: 0x5c4 */
  __IO uint32_t PLL3CFGR5;         /*!< RCC PLL{x} Configuration Register 5                                           Address offset: 0x5c8 */
       uint32_t RESERVED6;         /*!< Reserved                                                                      Address offset: 0x5cc */
  __IO uint32_t PLL3CFGR6;         /*!< RCC PLL{x} Configuration Register 6                                           Address offset: 0x5d0 */
  __IO uint32_t PLL3CFGR7;         /*!< RCC PLL{x} Configuration Register 7                                           Address offset: 0x5d4 */
       uint32_t RESERVED7[2];      /*!< Reserved                                                                      Address offset: 0x5d8-0x5dc */
  __IO uint32_t HSIFMONCR;         /*!< RCC HSI Frequency Monitoring Control Register                                 Address offset: 0x5e0 */
  __IO uint32_t HSIFVALR;          /*!< RCC HSI Frequency Value Register                                              Address offset: 0x5e4 */
       uint32_t RESERVED8[70];     /*!< Reserved                                                                      Address offset: 0x5e8-0x6fc */
  __IO uint32_t TIM1CFGR;          /*!< RCC TIM1 Configuration Register                                               Address offset: 0x700 */
  __IO uint32_t TIM2CFGR;          /*!< RCC TIM2 Configuration Register                                               Address offset: 0x704 */
  __IO uint32_t TIM3CFGR;          /*!< RCC TIM3 Configuration Register                                               Address offset: 0x708 */
  __IO uint32_t TIM4CFGR;          /*!< RCC TIM4 Configuration Register                                               Address offset: 0x70c */
  __IO uint32_t TIM5CFGR;          /*!< RCC TIM5 Configuration Register                                               Address offset: 0x710 */
  __IO uint32_t TIM6CFGR;          /*!< RCC TIM6 Configuration Register                                               Address offset: 0x714 */
  __IO uint32_t TIM7CFGR;          /*!< RCC TIM7 Configuration Register                                               Address offset: 0x718 */
  __IO uint32_t TIM8CFGR;          /*!< RCC TIM8 Configuration Register                                               Address offset: 0x71c */
  __IO uint32_t TIM10CFGR;         /*!< RCC TIM10 Configuration Register                                              Address offset: 0x720 */
  __IO uint32_t TIM11CFGR;         /*!< RCC TIM11 Configuration Register                                              Address offset: 0x724 */
  __IO uint32_t TIM12CFGR;         /*!< RCC TIM12 Configuration Register                                              Address offset: 0x728 */
  __IO uint32_t TIM13CFGR;         /*!< RCC TIM13 Configuration Register                                              Address offset: 0x72c */
  __IO uint32_t TIM14CFGR;         /*!< RCC TIM14 Configuration Register                                              Address offset: 0x730 */
  __IO uint32_t TIM15CFGR;         /*!< RCC TIM15 Configuration Register                                              Address offset: 0x734 */
  __IO uint32_t TIM16CFGR;         /*!< RCC TIM16 Configuration Register                                              Address offset: 0x738 */
  __IO uint32_t TIM17CFGR;         /*!< RCC TIM17 Configuration Register                                              Address offset: 0x73c */
       uint32_t RESERVED35;        /*!< Reserved                                                                      Address offset: 0x740 */
  __IO uint32_t LPTIM1CFGR;        /*!< RCC LPTIM1 Configuration Register                                             Address offset: 0x744 */
  __IO uint32_t LPTIM2CFGR;        /*!< RCC LPTIM2 Configuration Register                                             Address offset: 0x748 */
  __IO uint32_t LPTIM3CFGR;        /*!< RCC LPTIM3 Configuration Register                                             Address offset: 0x74c */
  __IO uint32_t LPTIM4CFGR;        /*!< RCC LPTIM4 Configuration Register                                             Address offset: 0x750 */
  __IO uint32_t LPTIM5CFGR;        /*!< RCC LPTIM5 Configuration Register                                             Address offset: 0x754 */
  __IO uint32_t SPI1CFGR;          /*!< RCC SPI1 Configuration Register                                               Address offset: 0x758 */
  __IO uint32_t SPI2CFGR;          /*!< RCC SPI2 Configuration Register                                               Address offset: 0x75c */
  __IO uint32_t SPI3CFGR;          /*!< RCC SPI3 Configuration Register                                               Address offset: 0x760 */
  __IO uint32_t SPI4CFGR;          /*!< RCC SPI4 Configuration Register                                               Address offset: 0x764 */
  __IO uint32_t SPI5CFGR;          /*!< RCC SPI5 Configuration Register                                               Address offset: 0x768 */
       uint32_t RESERVED36;        /*!< Reserved					                                                  Address offset: 0x76c */
       uint32_t RESERVED37;        /*!< Reserved					                                                  Address offset: 0x770 */
  __IO uint32_t SPI8CFGR;          /*!< RCC SPI8 Configuration Register                                               Address offset: 0x774 */
  __IO uint32_t SPDIFRXCFGR;       /*!< RCC SPDIFRX Configuration Register                                            Address offset: 0x778 */
  __IO uint32_t USART1CFGR;        /*!< RCC USART1 Configuration Register                                             Address offset: 0x77c */
  __IO uint32_t USART2CFGR;        /*!< RCC USART2 Configuration Register                                             Address offset: 0x780 */
  __IO uint32_t USART3CFGR;        /*!< RCC USART3 Configuration Register                                             Address offset: 0x784 */
  __IO uint32_t UART4CFGR;         /*!< RCC UART4 Configuration Register                                              Address offset: 0x788 */
  __IO uint32_t UART5CFGR;         /*!< RCC UART5 Configuration Register                                              Address offset: 0x78c */
  __IO uint32_t USART6CFGR;        /*!< RCC USART6 Configuration Register                                             Address offset: 0x790 */
  __IO uint32_t UART7CFGR;         /*!< RCC UART7 Configuration Register                                              Address offset: 0x794 */
       uint32_t RESERVED38;        /*!< Reserved					                                                  Address offset: 0x798 */
       uint32_t RESERVED39;        /*!< Reserved					                                                  Address offset: 0x79c */
  __IO uint32_t LPUART1CFGR;       /*!< RCC LPUART1 Configuration Register                                            Address offset: 0x7a0 */
