STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233axx_cm33.h
/*****************  Bit definition for ETH_MACTSILR register  *****************/
#define ETH_MACTSILR_ITLSNS_Pos             (8U)
#define ETH_MACTSILR_ITLSNS_Msk             (0xFFUL << ETH_MACTSILR_ITLSNS_Pos)                   /*!< 0x0000FF00 */
#define ETH_MACTSILR_ITLSNS                 ETH_MACTSILR_ITLSNS_Msk                              /*!< Ingress Timestamp Latency, in subnanoseconds */
#define ETH_MACTSILR_ITLNS_Pos              (16U)
#define ETH_MACTSILR_ITLNS_Msk              (0xFFFUL << ETH_MACTSILR_ITLNS_Pos)                   /*!< 0x0FFF0000 */
#define ETH_MACTSILR_ITLNS                  ETH_MACTSILR_ITLNS_Msk                               /*!< Ingress Timestamp Latency, in nanoseconds */

/*****************  Bit definition for ETH_MACTSELR register  *****************/
#define ETH_MACTSELR_ETLSNS_Pos             (8U)
#define ETH_MACTSELR_ETLSNS_Msk             (0xFFUL << ETH_MACTSELR_ETLSNS_Pos)                   /*!< 0x0000FF00 */
#define ETH_MACTSELR_ETLSNS                 ETH_MACTSELR_ETLSNS_Msk                              /*!< Egress Timestamp Latency, in subnanoseconds */
#define ETH_MACTSELR_ETLNS_Pos              (16U)
#define ETH_MACTSELR_ETLNS_Msk              (0xFFFUL << ETH_MACTSELR_ETLNS_Pos)                   /*!< 0x0FFF0000 */
#define ETH_MACTSELR_ETLNS                  ETH_MACTSELR_ETLNS_Msk                               /*!< Egress Timestamp Latency, in nanoseconds */

/*************  Bit definition for ETH_MACPPSCR register  **************/
#define ETH_MACPPSCR_PPSCTRL_Pos            (0U)
#define ETH_MACPPSCR_PPSCTRL_Msk            (0xFUL << ETH_MACPPSCR_PPSCTRL_Pos)                  /*!< 0x0000000F */
#define ETH_MACPPSCR_PPSCTRL                ETH_MACPPSCR_PPSCTRL_Msk                            /*!< PPS Output Frequency Control */
#define ETH_MACPPSCR_PPSCTRL_0              (0x1UL << ETH_MACPPSCR_PPSCTRL_Pos)                  /*!< 0x00000001 */
#define ETH_MACPPSCR_PPSCTRL_1              (0x2UL << ETH_MACPPSCR_PPSCTRL_Pos)                  /*!< 0x00000002 */
#define ETH_MACPPSCR_PPSCTRL_2              (0x4UL << ETH_MACPPSCR_PPSCTRL_Pos)                  /*!< 0x00000004 */
#define ETH_MACPPSCR_PPSCTRL_3              (0x8UL << ETH_MACPPSCR_PPSCTRL_Pos)                  /*!< 0x00000008 */
#define ETH_MACPPSCR_PPSEN0_Pos             (4U)
#define ETH_MACPPSCR_PPSEN0_Msk             (0x1UL << ETH_MACPPSCR_PPSEN0_Pos)                   /*!< 0x00000010 */
#define ETH_MACPPSCR_PPSEN0                 ETH_MACPPSCR_PPSEN0_Msk                             /*!< Flexible PPS Output Mode Enable */
#define ETH_MACPPSCR_TRGTMODSEL0_Pos        (5U)
#define ETH_MACPPSCR_TRGTMODSEL0_Msk        (0x3UL << ETH_MACPPSCR_TRGTMODSEL0_Pos)              /*!< 0x00000060 */
#define ETH_MACPPSCR_TRGTMODSEL0            ETH_MACPPSCR_TRGTMODSEL0_Msk                        /*!< Target Time Register Mode for PPS Output */
#define ETH_MACPPSCR_TRGTMODSEL0_0          (0x1UL << ETH_MACPPSCR_TRGTMODSEL0_Pos)              /*!< 0x00000020 */
#define ETH_MACPPSCR_TRGTMODSEL0_1          (0x2UL << ETH_MACPPSCR_TRGTMODSEL0_Pos)              /*!< 0x00000040 */
#define ETH_MACPPSCR_MCGREN0_Pos            (7U)
#define ETH_MACPPSCR_MCGREN0_Msk            (0x1UL << ETH_MACPPSCR_MCGREN0_Pos)                                       /*!< 0x00000080 */
#define ETH_MACPPSCR_MCGREN0                ETH_MACPPSCR_MCGREN0_Msk                                                 /*!< MCGR Mode Enable for PPS0 Output */
#define ETH_MACPPSCR_PPSCMD_Pos             (0U)
#define ETH_MACPPSCR_PPSCMD_Msk             (0xFUL << ETH_MACPPSCR_PPSCMD_Pos)                   /*!< 0x0000000F */
#define ETH_MACPPSCR_PPSCMD                 ETH_MACPPSCR_PPSCMD_Msk                             /*!< Flexible PPS Output (ptp_pps_o[0]) Control */
#define ETH_MACPPSCR_PPSCMD_0               (0x1UL << ETH_MACPPSCR_PPSCMD_Pos)                   /*!< 0x00000001 */
#define ETH_MACPPSCR_PPSCMD_1               (0x2UL << ETH_MACPPSCR_PPSCMD_Pos)                   /*!< 0x00000002 */
#define ETH_MACPPSCR_PPSCMD_2               (0x4UL << ETH_MACPPSCR_PPSCMD_Pos)                   /*!< 0x00000004 */
#define ETH_MACPPSCR_PPSCMD_3               (0x8UL << ETH_MACPPSCR_PPSCMD_Pos)                   /*!< 0x00000008 */
#define ETH_MACPPSCR_TIMESEL_Pos            (28U)
#define ETH_MACPPSCR_TIMESEL_Msk            (0x1UL << ETH_MACPPSCR_TIMESEL_Pos)                                       /*!< 0x10000000 */
#define ETH_MACPPSCR_TIMESEL                ETH_MACPPSCR_TIMESEL_Msk                                                 /*!< Time Select */

/***************  Bit definition for ETH_MACPPSTTS0R register  ****************/
#define ETH_MACPPSTTS0R_TSTRH0_Pos          (0U)
#define ETH_MACPPSTTS0R_TSTRH0_Msk          (0xFFFFFFFFUL << ETH_MACPPSTTS0R_TSTRH0_Pos)         /*!< 0xFFFFFFFF */
#define ETH_MACPPSTTS0R_TSTRH0              ETH_MACPPSTTS0R_TSTRH0_Msk                           /*!< PPS Target Time Seconds Register */

/***************  Bit definition for ETH_MACPPSTTN0R register  ****************/
#define ETH_MACPPSTTN0R_TTSL0_Pos           (0U)
#define ETH_MACPPSTTN0R_TTSL0_Msk           (0x7FFFFFFFUL << ETH_MACPPSTTN0R_TTSL0_Pos)           /*!< 0x7FFFFFFF */
#define ETH_MACPPSTTN0R_TTSL0               ETH_MACPPSTTN0R_TTSL0_Msk                            /*!< Target Time Low for PPS Register */
#define ETH_MACPPSTTN0R_TRGTBUSY0_Pos       (31U)
#define ETH_MACPPSTTN0R_TRGTBUSY0_Msk       (0x1UL << ETH_MACPPSTTN0R_TRGTBUSY0_Pos)              /*!< 0x80000000 */
#define ETH_MACPPSTTN0R_TRGTBUSY0           ETH_MACPPSTTN0R_TRGTBUSY0_Msk                        /*!< PPS Target Time Register Busy */

/****************  Bit definition for ETH_MACPPSI0R register  *****************/
#define ETH_MACPPSI0R_PPSINT0_Pos           (0U)
#define ETH_MACPPSI0R_PPSINT0_Msk           (0xFFFFFFFFUL << ETH_MACPPSI0R_PPSINT0_Pos)          /*!< 0xFFFFFFFF */
#define ETH_MACPPSI0R_PPSINT0               ETH_MACPPSI0R_PPSINT0_Msk                            /*!< PPS Output Signal Interval */

/****************  Bit definition for ETH_MACPPSW0R register  *****************/
#define ETH_MACPPSW0R_PPSWIDTH0_Pos         (0U)
#define ETH_MACPPSW0R_PPSWIDTH0_Msk         (0xFFFFFFFFUL << ETH_MACPPSW0R_PPSWIDTH0_Pos)        /*!< 0xFFFFFFFF */
#define ETH_MACPPSW0R_PPSWIDTH0             ETH_MACPPSW0R_PPSWIDTH0_Msk                          /*!< PPS Output Signal Width */

/***************  Bit definition for ETH_MACPPSTTS1R register  ****************/
#define ETH_MACPPSTTS1R_TSTRH0_Pos          (0U)
#define ETH_MACPPSTTS1R_TSTRH0_Msk          (0xFFFFFFFFUL << ETH_MACPPSTTS1R_TSTRH0_Pos)         /*!< 0xFFFFFFFF */
#define ETH_MACPPSTTS1R_TSTRH0              ETH_MACPPSTTS1R_TSTRH0_Msk                           /*!< PPS Target Time Seconds Register */

