STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233axx_cm33.h
/* Bit fields for RCC_PLL6CFGR5 register */
#define RCC_PLL6CFGR5_DIVVAL_Pos                     (0U)
#define RCC_PLL6CFGR5_DIVVAL_Msk                     (0xfUL  << RCC_PLL6CFGR5_DIVVAL_Pos)
#define RCC_PLL6CFGR5_DIVVAL                         RCC_PLL6CFGR5_DIVVAL_Msk
#define RCC_PLL6CFGR5_SPREAD_Pos                     (16U)
#define RCC_PLL6CFGR5_SPREAD_Msk                     (0x1fUL  << RCC_PLL6CFGR5_SPREAD_Pos)
#define RCC_PLL6CFGR5_SPREAD                         RCC_PLL6CFGR5_SPREAD_Msk

/* Bit fields for RCC_PLL6CFGR6 register */
#define RCC_PLL6CFGR6_POSTDIV1_Pos                   (0U)
#define RCC_PLL6CFGR6_POSTDIV1_Msk                   (0x7UL  << RCC_PLL6CFGR6_POSTDIV1_Pos)
#define RCC_PLL6CFGR6_POSTDIV1                       RCC_PLL6CFGR6_POSTDIV1_Msk

/* Bit fields for RCC_PLL6CFGR7 register */
#define RCC_PLL6CFGR7_POSTDIV2_Pos                   (0U)
#define RCC_PLL6CFGR7_POSTDIV2_Msk                   (0x7UL << RCC_PLL6CFGR7_POSTDIV2_Pos)
#define RCC_PLL6CFGR7_POSTDIV2                       RCC_PLL6CFGR7_POSTDIV2_Msk

/* Bit fields for RCC_PLL7CFGR1 register */
#define RCC_PLL7CFGR1_SSMODRST_Pos                   (0U)
#define RCC_PLL7CFGR1_SSMODRST_Msk                   (0x1UL << RCC_PLL7CFGR1_SSMODRST_Pos)
#define RCC_PLL7CFGR1_SSMODRST                       RCC_PLL7CFGR1_SSMODRST_Msk
#define RCC_PLL7CFGR1_PLLEN_Pos                      (8U)
#define RCC_PLL7CFGR1_PLLEN_Msk                      (0x1UL << RCC_PLL7CFGR1_PLLEN_Pos)
#define RCC_PLL7CFGR1_PLLEN                          RCC_PLL7CFGR1_PLLEN_Msk
#define RCC_PLL7CFGR1_PLLRDY_Pos                     (24U)
#define RCC_PLL7CFGR1_PLLRDY_Msk                     (0x1UL << RCC_PLL7CFGR1_PLLRDY_Pos)
#define RCC_PLL7CFGR1_PLLRDY                         RCC_PLL7CFGR1_PLLRDY_Msk
#define RCC_PLL7CFGR1_CKREFST_Pos                    (28U)
#define RCC_PLL7CFGR1_CKREFST_Msk                    (0x1UL << RCC_PLL7CFGR1_CKREFST_Pos)
#define RCC_PLL7CFGR1_CKREFST                        RCC_PLL7CFGR1_CKREFST_Msk

/* Bit fields for RCC_PLL7CFGR2 register */
#define RCC_PLL7CFGR2_FREFDIV_Pos                    (0U)
#define RCC_PLL7CFGR2_FREFDIV_Msk                    (0x3fUL << RCC_PLL7CFGR2_FREFDIV_Pos)
#define RCC_PLL7CFGR2_FREFDIV                        RCC_PLL7CFGR2_FREFDIV_Msk
#define RCC_PLL7CFGR2_FBDIV_Pos                      (16U)
#define RCC_PLL7CFGR2_FBDIV_Msk                      (0xfffUL << RCC_PLL7CFGR2_FBDIV_Pos)
#define RCC_PLL7CFGR2_FBDIV                          RCC_PLL7CFGR2_FBDIV_Msk

/* Bit fields for RCC_PLL7CFGR3 register */
#define RCC_PLL7CFGR3_FRACIN_Pos                     (0U)
#define RCC_PLL7CFGR3_FRACIN_Msk                     (0xffffffUL << RCC_PLL7CFGR3_FRACIN_Pos)
#define RCC_PLL7CFGR3_FRACIN                         RCC_PLL7CFGR3_FRACIN_Msk
#define RCC_PLL7CFGR3_DOWNSPREAD_Pos                 (24U)
#define RCC_PLL7CFGR3_DOWNSPREAD_Msk                 (0x1UL << RCC_PLL7CFGR3_DOWNSPREAD_Pos)
#define RCC_PLL7CFGR3_DOWNSPREAD                     RCC_PLL7CFGR3_DOWNSPREAD_Msk
#define RCC_PLL7CFGR3_DACEN_Pos                      (25U)
#define RCC_PLL7CFGR3_DACEN_Msk                      (0x1UL << RCC_PLL7CFGR3_DACEN_Pos)
#define RCC_PLL7CFGR3_DACEN                          RCC_PLL7CFGR3_DACEN_Msk
#define RCC_PLL7CFGR3_SSCGDIS_Pos                    (26U)
#define RCC_PLL7CFGR3_SSCGDIS_Msk                    (0x1UL << RCC_PLL7CFGR3_SSCGDIS_Pos)
#define RCC_PLL7CFGR3_SSCGDIS                        RCC_PLL7CFGR3_SSCGDIS_Msk

/* Bit fields for RCC_PLL7CFGR4 register */
#define RCC_PLL7CFGR4_DSMEN_Pos                      (8U)
#define RCC_PLL7CFGR4_DSMEN_Msk                      (0x1UL << RCC_PLL7CFGR4_DSMEN_Pos)
#define RCC_PLL7CFGR4_DSMEN                          RCC_PLL7CFGR4_DSMEN_Msk
#define RCC_PLL7CFGR4_FOUTPOSTDIVEN_Pos              (9U)
#define RCC_PLL7CFGR4_FOUTPOSTDIVEN_Msk              (0x1UL << RCC_PLL7CFGR4_FOUTPOSTDIVEN_Pos)
#define RCC_PLL7CFGR4_FOUTPOSTDIVEN                  RCC_PLL7CFGR4_FOUTPOSTDIVEN_Msk
#define RCC_PLL7CFGR4_BYPASS_Pos                     (10U)
#define RCC_PLL7CFGR4_BYPASS_Msk                     (0x1UL << RCC_PLL7CFGR4_BYPASS_Pos)
#define RCC_PLL7CFGR4_BYPASS                         RCC_PLL7CFGR4_BYPASS_Msk

/* Bit fields for RCC_PLL7CFGR5 register */
#define RCC_PLL7CFGR5_DIVVAL_Pos                     (0U)
#define RCC_PLL7CFGR5_DIVVAL_Msk                     (0xfUL << RCC_PLL7CFGR5_DIVVAL_Pos)
#define RCC_PLL7CFGR5_DIVVAL                         RCC_PLL7CFGR5_DIVVAL_Msk
#define RCC_PLL7CFGR5_SPREAD_Pos                     (16U)
#define RCC_PLL7CFGR5_SPREAD_Msk                     (0x1fUL << RCC_PLL7CFGR5_SPREAD_Pos)
#define RCC_PLL7CFGR5_SPREAD                         RCC_PLL7CFGR5_SPREAD_Msk

/* Bit fields for RCC_PLL7CFGR6 register */
#define RCC_PLL7CFGR6_POSTDIV1_Pos                   (0U)
#define RCC_PLL7CFGR6_POSTDIV1_Msk                   (0x7UL << RCC_PLL7CFGR6_POSTDIV1_Pos)
#define RCC_PLL7CFGR6_POSTDIV1                       RCC_PLL7CFGR6_POSTDIV1_Msk

/* Bit fields for RCC_PLL7CFGR7 register */
#define RCC_PLL7CFGR7_POSTDIV2_Pos                   (0U)
#define RCC_PLL7CFGR7_POSTDIV2_Msk                   (0x7UL << RCC_PLL7CFGR7_POSTDIV2_Pos)
#define RCC_PLL7CFGR7_POSTDIV2                       RCC_PLL7CFGR7_POSTDIV2_Msk

/* Bit fields for RCC_PLL8CFGR1 register */
#define RCC_PLL8CFGR1_SSMODRST_Pos                   (0U)
#define RCC_PLL8CFGR1_SSMODRST_Msk                   (0x1UL << RCC_PLL8CFGR1_SSMODRST_Pos)
#define RCC_PLL8CFGR1_SSMODRST                       RCC_PLL8CFGR1_SSMODRST_Msk
#define RCC_PLL8CFGR1_PLLEN_Pos                      (8U)
#define RCC_PLL8CFGR1_PLLEN_Msk                      (0x1UL << RCC_PLL8CFGR1_PLLEN_Pos)
#define RCC_PLL8CFGR1_PLLEN                          RCC_PLL8CFGR1_PLLEN_Msk
#define RCC_PLL8CFGR1_PLLRDY_Pos                     (24U)
#define RCC_PLL8CFGR1_PLLRDY_Msk                     (0x1UL << RCC_PLL8CFGR1_PLLRDY_Pos)
#define RCC_PLL8CFGR1_PLLRDY                         RCC_PLL8CFGR1_PLLRDY_Msk
#define RCC_PLL8CFGR1_CKREFST_Pos                    (28U)
#define RCC_PLL8CFGR1_CKREFST_Msk                    (0x1UL << RCC_PLL8CFGR1_CKREFST_Pos)
#define RCC_PLL8CFGR1_CKREFST                        RCC_PLL8CFGR1_CKREFST_Msk

/* Bit fields for RCC_PLL8CFGR2 register */
#define RCC_PLL8CFGR2_FREFDIV_Pos                    (0U)
#define RCC_PLL8CFGR2_FREFDIV_Msk                    (0x3fUL << RCC_PLL8CFGR2_FREFDIV_Pos)
#define RCC_PLL8CFGR2_FREFDIV                        RCC_PLL8CFGR2_FREFDIV_Msk
#define RCC_PLL8CFGR2_FBDIV_Pos                      (16U)
#define RCC_PLL8CFGR2_FBDIV_Msk                      (0xfffUL << RCC_PLL8CFGR2_FBDIV_Pos)
#define RCC_PLL8CFGR2_FBDIV                          RCC_PLL8CFGR2_FBDIV_Msk

